That is already possible with the `lifecycle` meta argument:
using something like:

```tf
resource "xenorchestra_cloud_config" "user_data" { }
resource "xenorchestra_cloud_config" "network_data" { }

resource "xenorchestra_vm" "vm" {
  lifecycle {
    replace_triggered_by = [
      xenorchestra_cloud_config.user_data,
      xenorchestra_cloud_config.network_data,
    ]
  }
}
```

Terraform replaces the vm whenever `user_data` or `network_data` has any changes.

That looks something like this

```shell
# xenorchestra_vm.vm will be replaced due to changes in replace_triggered_by
-/+ resource "xenorchestra_vm" "vm" {
      - blocked_operations   = [] -> null
      ~ cloud_config         = {REDACTED}
      ~ id                   = {REDACTED} -> (known after apply)
      ~ ipv4_addresses       = [
          - {REDACTED},
        ] -> (known after apply)
      ~ ipv6_addresses       = [
          - {REDACTED},
        ] -> (known after apply)
      ~ power_state          = "Running" -> (known after apply)
        tags                 = [
            {REDACTED}
        ]
        # (16 unchanged attributes hidden)
      ~ cdrom {
          ~ id = {REDACTED} -> {REDACTED}
        }
      ~ disk {
          - attached   = true -> null
          ~ position   = "0" -> (known after apply)
          ~ vbd_id     = {REDACTED} -> (known after apply)
          ~ vdi_id     = {REDACTED} -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ network {
          - attached       = true -> null
          ~ device         = "0" -> (known after apply)
          ~ ipv4_addresses = [
              - {REDACTED},
            ] -> (known after apply)
          ~ ipv6_addresses = [
              - {REDACTED},
            ] -> (known after apply)
          ~ mac_address    = {REDACTED} -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }
```

</detail>